[{"text": "The hotel I was staying in recommended this place. After an exauhsting day of moving I was very hungry and tired and pizza sounded great. I called and ordered just a pepperoni pizza. No big deal, right. I was told about 30-45 minutes. I waited for 90 minutes and still NO PIZZA! I called and like a previous post said, was put on hold for over 10 minutes. They finally came on the phone and simply stated the guy was on his way. Another 30 minutes and still no pizza. I went up to the lobby to see if there was another place I could call for some food as I was falling asleep waiting. As I was waiting to talk to the desk person the pizza guy walks in! Mind you this is over 2 hours after I ordered. He asks my name and hands me the receipt to sign and the pizza. The box didn't feel even warm, so I opened it and sure enough it was cold. I complained to him and he could have cared less. Needless to say, I didn't tip very much. I took my cold pizza back to my room and ate it cold as I was too tired to fight this place.\nBEWARE. They are rude and have no customer service whatsoever. If you don't mind waiting forever for a cold pizza, this is the place for you.", "stars": 1.0}, {"text": "The worst customer service~Spend 2 hours & 35 minutes on Monday trying to get service on my NEW Samsung Washer. The service provider \"Service Quick\" gave me more bad news & said in-stall by Lowe's was terrible. Repairman said Lowe's never did \"Smart Check\" so Washer could have had problems from the start! All 4 rockers were replaced & when Smart Check was started the Error code 8C1 came up, just like I reported & that is the Memory to the Washer, not 1 but all 3. Now I have to wait for parts & can't use my new washer! Can't get Lowe's to call me, so I have to go in person!! What a terrible situation after 4 days of communication but I still have a non working New Washer. Samsung had a recall of all Washer in 2016. Never buy Samsung..", "stars": 1.0}, {"text": "I have an appointment and I see people coming in and out I'm so pissed off like hello I've been waiting over an hr. I got here before it got packed and patients went in first than me they see me and don't even apologize for the wait wise I could give no stars never again as I coming here it's on Nellis", "stars": 1.0}, {"text": "I usually really like Milestones but this one star is specifically for the obnoxious server. He came around to our table with his little server apprentice who seemed to be new I suppose? taking notes? I'm not sure. Didn't really bother me but the main server dude seemed to think he was the most charming person in the world who was gracing us with his presence. \n\nSo anyway, my friend wanted alternatives for her food due to dietary restrictions and he was very short with her. And as the evening progressed he forgot all about us. It took him 45 minutes FORTY FIVE MINUTES to clear our table. We kept trying to meet his gaze but he looked right through us till we finally asked someone else to help us out. \n\nHe came back to us eventually...and we asked for a dessert menu (our mistake I know) which took him yet another 20 minutes to bring. By then we had already spent around 2 and a half hours there and were losing our patience. So when he came back in another 15 minutes to take dessert order we  just asked for the bill instead.\n\nAfter we paid the bill he just walked off without a word, no goodbye..no have a nice day..no sense of manners that you normally show to other people on a HUMAN level. It was highly disrespectful. Suffice it to say, never coming back here again. The server ruined the whole meal for us.", "stars": 1.0}, {"text": "First off I would like to say that my first massage was so amazing that I wanted to go back. I set up a new appointment about a week out. Less than two days before my appointment I receive a text that the person I was seeing was no longer with the company and that my appointment was cancelled. However this is where it started to go wrong. I get that people can come and go from a company but there was very little warning for the cancellation. Next in the email I received for the cancellation, it said that I had not been charged. Well I was charged the day I booked the appointment and have not gotten my money back! I left a phone call at the office a couple of days ago, for someone to refund me my money, but I have still not heard any response. I am still looking for someone to make this right.", "stars": 1.0}, {"text": "Didn't stay here but did a tour through all the vultures hunting young couples down at the Luxor and it was a miserable experience. The hotel looked like an extra large Holiday Inn and we were held hostage there for over five hours. The presentation and tour was full of sales activities and pitches making your head spin. I can't even begin to describe everything because it was so awful I don't want to recount it all. Anyway this is a timeshare scam that is a waste of time just for discounted event tickets...", "stars": 1.0}, {"text": "I order 2 Hazelnut Lattes.  They were wrong.  Was told to pull around the front for the correct drinks.  10 minutes later and I'm still sitting here in the parking lot. What an embarrassment and a waste of $9.", "stars": 1.0}, {"text": "I finally heard back from Mr. Reed.  I was told that he checked into our delayed check in, he said we arrived at 530ish not 4pm, does that really matter...we still didn't check into till 8pm?  Yes, the room was not ready, previous guest stayed longer, which caused a delay in getting the room ready, the guest was charged another day. Gave us a $50 credit, not good enough, for ruining our stay, we paid over $600 for a 3 bedroom suite, one night, 6 women...flying out the next morning.   Mr. Reed informed me that these suites are privately owned and that they do not follow the same procedure for credits as a \"regular\" Hilton.  He ended up giving us a total credit of $200.  I felt he was just giving me the run around.  They charged previous guest an extra night, and charged us full price for that same room, same night...hmmm??? Was not a pleasant experience, horrible customer service...first and last time staying there.  I suggest staying at Bally's or another place on the strip, way better pricing and better customer service.", "stars": 1.0}, {"text": "Don't bother wasting your time.  The service at Cowboy is terrible!  For a second time this year, they refuse to divide a 50 plus person (kid team sport celebration) bill according to family participants and simply divide it randomly and require a 20% gratuity.  We waited over 20 minutes for drinks and they had not even taken our food order by then.  The food is mediocre at best and no where near what it was when it first opened by Longo. Highly NOT recommended. For groups, go somewhere else.", "stars": 1.0}, {"text": "I went to Lola because a friend of mine recommended this place to me but their duck didn't taste that good and two of our dishes came out cold. Haven't been there since then.", "stars": 1.0}]